{
  "url": "https://oticfoundation.org/aboutus/",
  "title": "About Otic Foundation | Empowering Ugandans with AI Skills",
  "text": "Get to Know Otic Foundation: Empowering Communities Through Innovation About Us Otic Foundation is a visionary social enterprise dedicated to transforming lives and creating sustainable solutions. We leverage the power of technology, particularly artificial intelligence, to address pressing societal challenges, inspire change, and foster growth in communities worldwide. Our Mission and Vision Mission To democratize access to AI knowledge and emerging technologies through grassroots advocacy, free skilling initiatives, and community-driven programs that bridge digital divides and empower underrepresented groups for the future of work and sustainable development. Vision An Inclusive, AI empowered society where every community in Africa can thrive in the digital age. Our Core Values Need to grow by 2030 Innovation We embrace cutting-edge technology and creative thinking to develop solutions that address real-world challenges and open up new opportunities for growth. Collaboration Working together is at the heart of what we do. By fostering partnerships with individuals, organizations, and communities, we amplify our impact and create lasting change. Impact Our efforts are focused on achieving measurable outcomes that improve lives, strengthen communities, and contribute to a brighter future. Ethical Integrity We are committed to transparency, fairness, and responsibility in all our actions, ensuring our work remains grounded in trust and ethical principles. What We Do At Otic Foundation, we bridge the gap between technology and community needs by: AI Awareness and Skilling We offer training programs and workshops to bridge the AI skills gap in Uganda. Advocacy We champion AI regulation through engagement with policy makers. AI Ecosystem We are proponents of developing the necessary infrastructure, such as data centers and research labs, tosupport AI innovation in Uganda. Latest At Otic Stay updated with the latest stories, innovations, and initiatives from Otic Foundation. Get In Touch Our Team​ Meet the Dedicated Minds Behind Otic Foundation Founder & CEODirector - Admin OpsAdvisory Board LeadCommunity EngagementMedia and Comm.Head of Finance Contact Us Do you have questions or want to collaborate? We’d love to hear from you!Reach out to us via phone, email, or our contact form, and let’s work together to create meaningful change. Follow Us Facebook-f Linkedin Instagram X-twitter National ICT Innovation Hub - Kampala - Uganda +256 756722263 / +256 706867547 info@oticfoundation.org Timing: 8am -5pm",
  "links": [
    "https://oticfoundation.org/careers/",
    "https://oticfoundation.org/team/",
    "https://oticfoundation.org/privacy-policy/",
    "https://oticfoundation.org/contactus/",
    "https://oticfoundation.org/aboutus/",
    "https://oticfoundation.org/",
    "https://oticfoundation.org/?page_id=51"
  ]
}