{
  "url": "https://oticfoundation.org/careers/",
  "title": "Careers at Otic Foundation | AI Opportunities in Uganda",
  "text": "Join Our Mission to Drive Change Be Part of a Team That Innovates, Inspires, and Empowers At Otic Foundation, we believe that great people make great change. Join a diverse and passionate team committed to leveraging technology and innovation to empower communities and create a brighter future. Why Work With Us Why You Should Choose Otic Foundation Purpose-Driven Work Join a team dedicated to creating real change through innovative technology and community-driven initiatives. Every role at Otic Foundation contributes directly to our mission of empowerment and impact. Opportunities for Growth At Otic Foundation, we invest in our people. From professional development workshops to mentorship programs, we provide opportunities to grow your skills and advance your career Collaborative Environment Be part of a supportive and inclusive culture where teamwork, diversity, and creativity thrive. Together, we achieve more. Work That Inspires Experience the satisfaction of meaningful work in a dynamic organization. Each day brings opportunities to innovate, inspire, and make a positive difference. Careers Explore Our Current Opportunities. Browse our open roles and find a position that matches your skills and passions. Coming Soon How to Apply Ready to Join Us Explore Open Positions Tap ‘Apply Now’ Submit Your Credentials Await Our Response Browse our current job openings to find the role that matches your expertise and interests. Click the “Apply Now” button, which will redirect you to our secure application portal. Complete the online application form by filling in your personal details, uploading your resume, and answering specific questions related to the role. Once your application is submitted, our team will review it carefully. Shortlisted candidates will be contacted for the next steps. Testimonials Hear From Our Team During my time with the Otic Foundation, I’ve been deeply moved by the transformative impact we’ve had through our AI literacy and skilling programs. It’s incredibly rewarding to witness lives being changed, as men and women are introduced to new possibilities beyond the ordinary. If you’re passionate about making a difference in the world, Otic is the perfect place to be. Patience AsiimweHead of Finance Working at Otic Foundation pushes me beyond my comfort zone every day, offering invaluable exposure and growth. Most importantly, it has given me the privilege of contributing to a vision that strives to create a meaningful impact for the greater good of my country. Elijah BOperations Lead Our Values in ActionOur Values, Your Opportunity InnovationWe thrive on creativity and forward-thinking. At Otic Foundation, you’ll be part of a team that develops cutting-edge solutions and implements bold ideas. Join us to innovate and make a difference. CollaborationTeamwork is at the core of what we do. From cross-functional projects to global partnerships, we value working together to achieve greater impact. As part of our team, you’ll collaborate with passionate professionals and inspiring leaders. ImpactEverything we do is driven by a desire to create measurable change. Whether it’s through technology or community outreach, your work will directly contribute to initiatives that improve lives and build resilient communities. Ethical IntegrityWe believe in doing the right thing, always. At Otic Foundation, you’ll be part of an organization that values honesty, transparency, and respect. Your work will align with principles that ensure trust and accountability. Frequently Asked Questions. What is the application process like? The process is simple. Browse our open positions, click “Apply Now,” and fill in the application form with your details and credentials. Shortlisted candidates will be contacted for the next steps, such as interviews or assessments. What growth opportunities are available at Otic Foundation? We are committed to professional development. Employees have access to workshops, mentorship programs, and training sessions tailored to enhance their skills and career progression. How does Otic Foundation support work-life balance? We prioritize a healthy work-life balance through flexible work schedules, wellness programs, and a supportive work environment that values your well-being. What type of roles does Otic Foundation typically offer? Our opportunities span a variety of fields, including technology, community development, operations, marketing, and more. Explore our Careers Page to see current openings. Contact Us Do you have questions or want to collaborate? We’d love to hear from you!Reach out to us via phone, email, or our contact form, and let’s work together to create meaningful change. Follow Us Facebook-f Linkedin Instagram X-twitter National ICT Innovation Hub - Kampala - Uganda +256 756722263 / +256 706867547 info@oticfoundation.org Timing: 8am -5pm",
  "links": [
    "https://oticfoundation.org/careers/",
    "https://oticfoundation.org/team/",
    "https://oticfoundation.org/privacy-policy/",
    "https://oticfoundation.org/contactus/",
    "https://oticfoundation.org/aboutus/",
    "https://oticfoundation.org/",
    "https://oticfoundation.org/?page_id=51"
  ]
}