{
  "url": "https://oticfoundation.org",
  "title": "Otic Foundation | AI Training for Uganda",
  "text": "Shaping Uganda’s Digital Future Through AI and Innovation. Join us in creating sustainable change through education, innovation, and community engagement Visit our Academy Otic FoundationEmpowering Ugandans with the skills to thrive in the 4th Industrial Revolution. Who we Are Otic Foundation is a dynamic and leading social enterprise in Uganda, committed to leveraging AI to create societal impact. Officially endorsed by the Ugandan Ministry of ICT & National Guidance, our mission is to raise 3 million AI talents by 2030. Learn more about Otic Foundation Our Mission and Vision Mission To democratize access to AI knowledge and emerging technologies through grassroots advocacy, free skilling initiatives, and community- driven programs that bridge digital divides and empower underrepresented groups for the future of work and sustainable development. Vision An Inclusive, AI-empowered society where every community in Uganda and Africa can thrive in the digital age. Our Three Pillars of Impact Our Approach at Otic Foundation is embedded with 3 key pillars Skilling and Awareness We train Ugandans in schools, universities, bootcamp programs, corporate organisations and online learning communities Advocacy We champion a supportive regulatory environment that supports AI adoption & education Infrastructure We are committed to establishing the necessary infrastructure for AI development Our Impact At Glance Our Journey summarized in Numbers Students Impacted + Institutions Reached + People in our Community + Partners + Stories Of Impact Otic Foundation Our Core Programs Let’s start the journey towards success. Learn Data Analytics Learn to analyze, visualize, and interpret data using tools like Python, R, and SQL. Gain skills to make data-driven decisions and solve real-world problems effectively. Explore Learn Cybersecurity Master cybersecurity essentials through our professional course, transforming beginners into experts with hands-on training to protect against modern threats. Coming Soon More Coming Soon Get opportunity to gain technological skills that improve the innovation funnel with new tips & tricks. Our Initiatives Creating Impact in Society AI in Every City This Free AI program aimed at democratizing AI across the country, attracted over 900 applications. Participants were tasked with completing a hackathon in Python for Data Science and Machine learning and a project for Microsoft Power BI. Read Now National Free AI Skilling Initiative By making AI education free and widely accessible, participants will receive hands-on training in Machine Learning, Data Science, Generative AI, and Cybersecurity, fields that are defining the future of technology in the Fourth Industrial Revolution (4IR). Read Now Partners We Value Here is a collection of logos representing the esteemed partners we collaborate with. Learn From Those That Work With Us Working at Otic Foundation pushes me beyond my comfort zone every day, offering invaluable exposure and growth. Most importantly, it has given me the privilege of contributing to a vision that strives to create a meaningful impact for the greater good of my country. Elijah B Operations lead My work at Otic Foundation has been game-changer in my professional life. From shifting my mindset to navigating the working world, I've learned to embrace change, unlearn a few old habits, and level up. My genuine take for anyone considering Otic: be ready to adapt, laugh at the chaos, and grow like never before! Prepare to discover the best version of yourself, one AI lesson at a time. Nakawalya Patricia D.A Operations Officer Being part of this incredible team, I’ve witnessed our collective drive to make this vision a reality. Together, we are transforming lives, empowering communities, and equipping individuals with AI skills to thrive and transact meaningfully in today’s world. It’s a journey of impact, progress, and purpose. Martin Ayebazibwe Director - Admin&Ops Work With Us Make a Difference Today. Your support transforms lives. Check out Our Careers Otic Foundation Stay Connected Reach Out to Us for Any Inquires Contact Us Now",
  "links": [
    "https://oticfoundation.org/careers/",
    "https://oticfoundation.org/team/",
    "https://oticfoundation.org",
    "https://oticfoundation.org/privacy-policy/",
    "https://oticfoundation.org/contactus/",
    "https://oticfoundation.org/nfasi/",
    "https://oticfoundation.org/ai-in-every-city/",
    "https://oticfoundation.org/aboutus/",
    "https://oticfoundation.org/?page_id=51",
    "https://oticfoundation.org/"
  ]
}