{
  "url": "https://oticfoundation.org/team/",
  "title": "Meet the Otic Foundation Team | AI Leadership in Uganda",
  "text": "The People Behind Otic Foundation Innovators, Changemakers, and Visionaries Our team is a passionate group of innovators, educators, and changemakers who are committed to transforming lives through technology and collaboration. Together, we work towards a shared vision of creating a brighter, more inclusive future. Meet The Team Our team is the heart and soul of Otic Foundation. Together, we bring diverse perspectives and a shared dedication to leveraging technology and innovation for the betterment of society. Every member plays a vital role in driving our mission forward and turning our vision into reality. Management Team Mr. Martin Ayebazibwe Director - Admin & Ops Mr. Paul Nesta Katende Founder & CEO Ms. Patience Asiimwe Head of Finance Mr. Bill Dan Arnold Borodi Head of Media & Communications Mr. Julius Basiima Community Engagement Lead Advisory Board Mr. Daniel Reime Advisory Board Lead Ms. Yasmin Kayali Sabra Advisory Board Member Mr. Thomas Thorsell-Arntsen Advisory Board Member Mr. Kenneth Oduka Advisory Board Member Dr. Abhishesh Pal Advisory Board Member Why Our Team Stands Out Our team is composed of experts with diverse backgrounds in technology, education, and community development. Together, we bring years of experience and a shared passion for driving change. This dedication ensures every initiative is impactful, innovative, and inclusive. Be a Part of the Change Join Our Team Passionate about innovation and community impact? Join Otic Foundation and help shape the future. Explore our open positions and volunteer opportunities to become part of our mission. Careers",
  "links": [
    "https://oticfoundation.org/careers/",
    "https://oticfoundation.org/team/",
    "https://oticfoundation.org/privacy-policy/",
    "https://oticfoundation.org/contactus/",
    "https://oticfoundation.org/aboutus/",
    "https://oticfoundation.org/",
    "https://oticfoundation.org/?page_id=51"
  ]
}